a = ('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')
print(a)

b = input('Введите пропущенное слово "покрытая ...": ')

c = input('Введите пропущенную букву в слове "кожиц..й": ')

d = input('Введите пропущенное слово "на ...": ')

e = input('Введите пропущенное слово "затянута ...": ')

f = input('Введите пропущенное слово "нижняя ...": ')

g = input('Введите пропущенную букву в слове "шляпк..": ' )

print('Шляпка гриба, покрытая', b, 'кожиц' + c + 'й', 'держится на', d, 'ножке. Снизу шляпка затянута', e, 'плёнкой. Когда её уберёшь, откроется нижняя', f, 'сторона шляпк' + g)